MoyasarTest/Fixtures/Invoice/Canceled.json

{
  "id": "f91065f7-d188-4ec8-8fc5-af97841ec14e",
  "status": "canceled",
  "amount": 7000,
  "currency": "SAR",
  "description": "A 70 SAR invoice just because",
  "expired_at": "2016-04-07T06:45:18.866Z",
  "logo_url": "https://s3-eu-west-1.amazonaws.com/moyasar.api.assets.prod/entities/logos/default.png",
  "amount_format": "70.00 SAR",
  "url": "https://dashboard.moyasar.com/invoices/37a54bed-7d54-444c-a151-c287106da514?lang=en",
  "callback_url": "http://www.example.com/invoice_callback",
  "created_at": "2016-04-06T06:45:18.866Z",
  "updated_at": "2016-04-06T06:45:18.866Z",
  "payments": [],
  "metadata": {}
}
